Did you remember to run the `sql_variables.sh script` before opening up jupyter notebook?  `. ~/Desktop/sql_variables.sh`

In [1]:
import pymysql
import pandas as pd
import os

In [2]:
conn = pymysql.connect(host=os.environ.get('SQLHOSTID'),
                      port=3306,
                      user=os.environ.get('SQLUSERID'),
                      passwd = os.environ.get('SQLPASSWORD'),
                      db='financial')

In [16]:
loan_df = pd.read_sql("SELECT * FROM loan l \
                 JOIN account a  ON l.account_id = a. account_id \
                 JOIN district d ON a.district_id = d.district_id \
                 ORDER BY l.account_id", conn)

In [17]:
loan_df.head()

,loan_id,account_id,date,amount,duration,payments,status,account_id,district_id,frequency,...,A7,A8,A9,A10,A11,A12,A13,A14,A15,A16
0,4959,2,1994-01-05,80952,24,3373.0,A,2,1,POPLATEK MESICNE,...,0,1,1,100.0,12541,0.2,0.43,167,85677.0,99107
1,4961,19,1996-04-29,30276,12,2523.0,B,19,21,POPLATEK MESICNE,...,7,1,7,67.0,9104,1.5,2.07,123,2299.0,2354
2,4962,25,1997-12-08,30276,12,2523.0,A,25,68,POPLATEK MESICNE,...,18,2,6,57.2,9893,4.0,4.72,96,5623.0,5887
3,4967,37,1998-10-14,318480,60,5308.0,D,37,20,POPLATEK MESICNE,...,3,1,4,58.4,8547,2.6,3.64,120,1563.0,1542
4,4968,38,1998-04-19,110736,48,2307.0,C,38,19,POPLATEK TYDNE,...,3,1,4,52.7,8402,3.1,3.98,120,999.0,1099

In [19]:
loan_df.shape

(682, 27)

In [11]:
loan_order_df = pd.read_sql("SELECT * FROM loan l \
                    JOIN financial.order o ON l.account_id = o.account_id", conn)

In [15]:
loan_order_df.head()

,loan_id,account_id,date,amount,duration,payments,status,order_id,account_id,bank_to,account_to,amount,k_symbol
0,4959,2,1994-01-05,80952,24,3373.0,A,29402,2,ST,89597016,3372.7,UVER
1,4959,2,1994-01-05,80952,24,3373.0,A,29403,2,QR,13943797,7266.0,SIPO
2,4961,19,1996-04-29,30276,12,2523.0,B,29423,19,QR,14132368,2523.2,UVER
3,4962,25,1997-12-08,30276,12,2523.0,A,29431,25,YZ,1301700,2523.2,UVER
4,4962,25,1997-12-08,30276,12,2523.0,A,29432,25,IJ,4896235,6817.0,SIPO

In [13]:
loan_order_df.shape

(1513, 13)

In [20]:
acct_client_df = pd.read_sql("SELECT * FROM  account a \
                        JOIN disp di ON a.account_id = di.account_id \
                        JOIN client c ON c.client_id = di.client_id \
                        ORDER BY a.account_id", conn)

In [23]:
acct_client_df.head()

,account_id,district_id,frequency,date,disp_id,client_id,account_id,type,client_id,gender,birth_date,district_id
0,1,18,POPLATEK MESICNE,1995-03-24,1,1,1,OWNER,1,F,1970-12-13,18
1,2,1,POPLATEK MESICNE,1993-02-26,2,2,2,OWNER,2,M,1945-02-04,1
2,2,1,POPLATEK MESICNE,1993-02-26,3,3,2,DISPONENT,3,F,1940-10-09,1
3,3,5,POPLATEK MESICNE,1997-07-07,4,4,3,OWNER,4,M,1956-12-01,5
4,3,5,POPLATEK MESICNE,1997-07-07,5,5,3,DISPONENT,5,F,1960-07-03,5

In [22]:
#Close the connection after you get what you want
conn.close()

In [24]:
#Writing to csv
loan_df.to_csv('data/loan.csv', index=False)
loan_order_df.to_csv('data/loan_order.csv', index=False)
acct_client_df.to_csv('data/acct_client.csv', index=False)

In [27]:
#Check that we can read this back into the notebook
df_check = pd.read_csv('data/acct_client.csv')
df_check.head()

,account_id,district_id,frequency,date,disp_id,client_id,account_id.1,type,client_id.1,gender,birth_date,district_id.1
0,1,18,POPLATEK MESICNE,1995-03-24,1,1,1,OWNER,1,F,1970-12-13,18
1,2,1,POPLATEK MESICNE,1993-02-26,2,2,2,OWNER,2,M,1945-02-04,1
2,2,1,POPLATEK MESICNE,1993-02-26,3,3,2,DISPONENT,3,F,1940-10-09,1
3,3,5,POPLATEK MESICNE,1997-07-07,4,4,3,OWNER,4,M,1956-12-01,5
4,3,5,POPLATEK MESICNE,1997-07-07,5,5,3,DISPONENT,5,F,1960-07-03,5